jmeter.log
2022/09/18 09:12:34 INFO  - jmeter.util.JMeterUtils: Setting Locale to fr_FR 
2022/09/18 09:12:34 INFO  - jmeter.util.JMeterUtils: Could not find resources for 'fr_FR', using 'fr' 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: Loading user properties from: /usr/share/jmeter/bin/user.properties 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: Loading system properties from: /usr/share/jmeter/bin/system.properties 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: Copyright (c) 1998-2015 The Apache Software Foundation 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: Version 2.13.20180731 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: java.version=11.0.16 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: java.vm.name=OpenJDK 64-Bit Server VM 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: os.name=Linux 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: os.arch=amd64 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: os.version=5.10.0-18-amd64 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: Default Locale=français (France) 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: JMeter  Locale=français (France) 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: JMeterHome=/usr/share/jmeter 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: user.dir  =/home/user/Documents/projets/collab/proposition_formation_devops/cours et quizz/2.Module Automation & Cloud public/2.Jenkins/fichiers_Jenkins3/Corrige_exercice4_test_jmeter_website 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: PWD       =/home/user/Documents/projets/collab/proposition_formation_devops/cours et quizz/2.Module Automation & Cloud public/2.Jenkins/fichiers_Jenkins3/Corrige_exercice4_test_jmeter_website 
2022/09/18 09:12:34 INFO  - jmeter.JMeter: IP: 127.0.1.1 Name: capsulecorp FullName: capsulecorp 
2022/09/18 09:12:34 INFO  - jmeter.services.FileServer: Default base='/home/user/Documents/projets/collab/proposition_formation_devops/cours et quizz/2.Module Automation & Cloud public/2.Jenkins/fichiers_Jenkins3/Corrige_exercice4_test_jmeter_website' 
2022/09/18 09:12:34 INFO  - jmeter.services.FileServer: Set new base='/home/user/Documents/projets/collab/proposition_formation_devops/cours et quizz/2.Module Automation & Cloud public/2.Jenkins/fichiers_Jenkins3/Corrige_exercice4_test_jmeter_website' 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: Using SaveService properties version 2.8 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: Using SaveService properties file version 1656252 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2022/09/18 09:12:35 INFO  - jmeter.save.SaveService: Loading file: planeta_test.jmx 
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Cannot find .className property for htmlParser, using default 
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is  
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is  
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is  
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is  
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2022/09/18 09:12:35 INFO  - jmeter.JMeter: Creating summariser <summary> 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: Listeners will be started after enabling running version 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: To revert to the earlier behaviour, define jmeterengine.startlistenerslater=false 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2022/09/18 09:12:35 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2022/09/18 09:12:35 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2022/09/18 09:12:35 INFO  - jmeter.JMeter: Lancer test (1663485155427) 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: Starting 10 threads for group Thread Group. 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: Thread will continue on error 
2022/09/18 09:12:35 INFO  - jmeter.threads.ThreadGroup: Starting thread group number 1 threads 10 ramp-up 1 perThread 100.0 delayedStart=false 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: jmeterthread.startearlier=true (see jmeter.properties) 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Running PostProcessors in forward order 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-1 
2022/09/18 09:12:35 INFO  - jmeter.threads.ThreadGroup: Started thread group number 1 
2022/09/18 09:12:35 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPHCAbstractImpl: Local host = capsulecorp 
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: HTTP request retry count = 0 
2022/09/18 09:12:35 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: Setting up HTTPS TrustAll scheme 
2022/09/18 09:12:35 INFO  - jmeter.util.JsseSSLManager: Using default SSL protocol: TLS 
2022/09/18 09:12:35 INFO  - jmeter.util.JsseSSLManager: SSL session context: per-thread 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-2 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-3 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-4 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2022/09/18 09:12:35 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-5 
2022/09/18 09:12:35 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-6 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-7 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-8 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-9 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-4 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-4 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-3 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-3 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-1 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-1 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-10 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-5 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-5 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-2 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-2 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-6 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-6 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-7 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-7 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-8 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-8 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-9 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-9 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-10 
2022/09/18 09:12:36 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-10 
2022/09/18 09:12:36 INFO  - jmeter.engine.StandardJMeterEngine: Notifying test listeners of end of test 
2022/09/18 09:12:36 INFO  - jmeter.reporters.Summariser: summary =     10 in   1,4s =    7,3/s Avg:   514 Min:   413 Max:   691 Err:     0 (0,00%)